docs/tracking/2026-02-23_MIXFIX_SYNTAX_DESIGN.org
#+TITLE: Mixfix Syntax Design: Research Survey & Proposal
#+DATE: 2026-02-23
#+STATUS: DESIGN REVIEW

* Executive Summary

Prologos is a homoiconic language with prefix notation as the default: =[f x y]=, =(fn ...)=. This document designs a *lightweight mixfix sublanguage* invoked via =.{...}= delimiters, enabling natural infix arithmetic (=.{a + b * c}=) while preserving homoiconicity. The design also covers user-definable operator precedence via a =:mixfix= key on =spec=, and a standard precedence table for library operators.

The key insight: =.{...}= is syntactic sugar that desugars to prefix s-expressions at the preparse stage. The canonical data representation is always prefix. This is analogous to how our WS-mode syntax desugars to sexp forms -- the infix is a *reading convenience*, not a semantic layer.

** Design Principles

1. *Homoiconicity preserved*: =.{a + b}= desugars to =[add a b]= (or the trait-dispatched generic form). The datum representation is always prefix.
2. *Wildcard partial application*: =.{_ + 1}= desugars to =(fn [$_0] [add $_0 1])=, reusing the existing placeholder machinery.
3. *User-definable precedence*: via =:mixfix= metadata key on =spec=, using named precedence groups (Swift/Rhombus model).
4. *Standard library uses the same system*: =+=, =*=, =<= etc. are defined with =:mixfix= metadata, not hard-coded.
5. *Reject on ambiguity*: if two operators have no declared precedence relationship, =.{...}= containing both is a compile error requiring explicit grouping.

* Part I: Research Survey

** 1. Agda — Full Mixfix with DAG Precedence

Agda has *no built-in operators*. Every operator is user-defined using underscores as argument slots:

| Pattern            | Kind      | Example                      |
|--------------------+-----------+------------------------------|
| =_+_=              | infix     | =1 + 2=                     |
| =-_=               | prefix    | =- x=                       |
| =_!=               | postfix   | =n !=                        |
| =if_then_else_=    | mixfix    | =if b then x else y=        |
| =[_]=              | circumfix | =[ x ]=                     |

Precedence is declared via =infixl N=, =infixr N=, =infix N= where N is any number (including fractions and negatives). Default is 20. The precedence relation forms a *DAG* -- two operators at the same level are *unrelated* unless they share associativity, making their combination ambiguous (parse error).

*** Agda Standard Library Convention (Haskell-like)

| Level | Assoc    | Operators                              |
|-------+----------+----------------------------------------|
|    -1 | =infixr= | =$= (function application)             |
|     0 | =infixl= | =\vert>= (pipe)                       |
|     4 | =infix=  | ~=~, ~<=~, ~<~, ~>=~, ~>~             |
|     5 | =infixr= | =\lor=, =xor=, =::= (cons)            |
|     6 | =infixl= | =+=, =-=, =\land=                      |
|     7 | =infixl= | =*=                                    |
|     8 | =infixr= | =^= (exponentiation)                   |
|     9 | =infixr= | =.= (composition)                      |

*** Key Lessons from Agda
- *Strength*: Maximum expressiveness; =if_then_else_= is user-definable.
- *Weakness*: Parsing and scope-checking are entangled. Missing imports produce confusing parse errors instead of "not in scope" errors.
- *Weakness*: No cross-library precedence coordination. Different projects use incompatible level schemes.
- *Weakness*: Error messages for mixfix parse failures are notoriously unhelpful.
- *Paper*: Danielsson & Norell, "Parsing Mixfix Operators" (IFL 2008) -- the foundational algorithm.

** 2. Maude — Mixfix with Gather Patterns

Maude uses the same underscore-for-argument notation, but with a unique *gather pattern* system for associativity:

#+begin_example
op _+_ : Nat Nat -> Nat [prec 33 gather (E e)] .
op _*_ : Nat Nat -> Nat [prec 31 gather (E e)] .
#+end_example

| Symbol | Meaning                                            |
|--------+----------------------------------------------------|
| =e=    | Argument top-op precedence must be *strictly less*  |
| =E=    | Argument top-op precedence must be *less or equal* |
| =&=    | Any precedence accepted                            |

Left-associativity = =gather (E e)=: left arg can be same-precedence, right cannot. Right-associativity = =gather (e E)=. Non-associative = =gather (e e)=.

Precedence is numeric, lower = tighter (0-127 by convention). *Opposite direction from Prolog/Haskell*.

*** Maude Standard Precedence Table

| Prec | Operators                | Notes           |
|------+--------------------------+-----------------|
|   29 | =^=                      | Exponentiation  |
|   31 | =*=, =quo=, =rem=        | Multiplicative  |
|   33 | =+=                      | Additive        |
|   37 | =<=, =>=, =>==, =>==     | Comparison      |
|   51 | ====, ==/==              | Equality        |
|   53 | =not=                    | Boolean NOT     |
|   55 | =and=                    | Boolean AND     |
|   57 | =xor=                    | Boolean XOR     |
|   59 | =or=                     | Boolean OR      |
|   61 | =implies=                | Implication     |

*** Key Lessons from Maude
- *Strength*: =gather= patterns are more expressive than simple left/right associativity -- each argument position has independent control.
- *Weakness*: Default =gather (E E)= is ambiguous for binary operators -- you /must/ declare explicitly.
- *Weakness*: Ambiguous parses are resolved *silently by arbitrary choice* with only a warning. This is a foot-gun.
- *Gotcha*: The juxtaposition operator (=__= for list concatenation) interacts badly with infix operators.

