docs/tracking/2026-02-23_MIXFIX_SYNTAX_DESIGN.org
** 3. Prolog — User-Defined Operators with Type Specifiers

Prolog operators are purely syntactic sugar declared via =op(Precedence, Type, Name)=:

| Specifier | Kind    | Associativity  | Meaning                                 |
|-----------+---------+----------------+-----------------------------------------|
| =xfx=     | infix   | non-associative | Both args strictly lower               |
| =xfy=     | infix   | right-assoc    | Left strict, right can be equal        |
| =yfx=     | infix   | left-assoc     | Left can be equal, right strict        |
| =fx=      | prefix  | non-assoc      | Arg strictly lower                     |
| =fy=      | prefix  | right-assoc    | Arg can be equal (allows chaining)     |
| =xf=      | postfix | non-assoc      | Arg strictly lower                     |
| =yf=      | postfix | left-assoc     | Arg can be equal                       |

Precedence range is 1-1200 (higher = looser, opposite of Maude). The =x= vs =y= convention encodes the same idea as Maude's =e= vs =E=: strict-less-than vs less-or-equal.

*** ISO Standard Operator Table

| Prec | Type  | Operators                                          |
|------+-------+----------------------------------------------------|
| 1200 | =xfx= | =:-=, =-->=                                        |
| 1100 | =xfy= | =;=                                                |
| 1050 | =xfy= | =->=                                               |
| 1000 | =xfy= | =,=                                                |
|  900 | =fy=  | =\+=                                               |
|  700 | =xfx= | ===, =\==, =====, =is=, =<=, =>=, ==<=, =>==     |
|  500 | =yfx= | =+=, =-=, =/\=, =\/=                               |
|  400 | =yfx= | =*=, =/=, =//=, =rem=, =mod=                      |
|  200 | =xfx= | =**=                                               |
|  200 | =fy=  | =-=, =+=, =\=                                      |

*** Key Lessons from Prolog
- *Strength*: 1200 levels means you never run out of room to insert new operators.
- *Weakness*: Cognitive overload -- nobody memorizes which standard operators are at 500 vs 700.
- *Weakness*: Global mutable operator table. Any loaded file can change how subsequent code is parsed.
- *Weakness*: No module scoping by default (SWI-Prolog adds module-local operators).
- *Gotcha*: =op/3= is purely syntactic -- it defines notation, not semantics.

** 4. Haskell — Explicit Numeric Precedence (0-9)

#+begin_example
infixl 6 +, -
infixl 7 *, /
infixr 5 :, ++
infix  4 ==, /=, <, <=, >, >=
infixr 3 &&
infixr 2 ||
infixr 0 $
#+end_example

Function application (whitespace) is at an implicit level 10, always tightest. Backtick syntax (=`div`=) lets any function be used infix.

*** Key Lessons from Haskell
- *Strength*: Simple, well-understood, works well in practice for a standard library.
- *Weakness*: Only 10 levels. Libraries compete for scarce slots. Re-exports and wrappers silently lose fixity.
- *Weakness*: Fixity is not part of the type signature -- it is "secret" metadata.
- *Gotcha*: The =$= operator required a hard-coded special typing rule in GHC for years due to impredicativity.
- *Gotcha*: Two operators at the same level with different associativity produce a parse error, not a predictable result.

** 5. Swift — Named Precedence Groups (Partial Order DAG)

Swift (since SE-0077) uses *named precedence groups* forming a DAG via =higherThan= / =lowerThan=:

#+begin_src swift
precedencegroup ExponentiationPrecedence {
    higherThan: MultiplicationPrecedence
    associativity: right
}
infix operator ** : ExponentiationPrecedence
#+end_src

*** Standard Precedence Groups

| Group                         | Assoc | Operators               | Higher Than            |
|-------------------------------+-------+-------------------------+------------------------|
| BitwiseShiftPrecedence        | none  | =<<=, =>>=              | Multiplication         |
| MultiplicationPrecedence      | left  | =*=, =/=, =%=, =&=     | Addition               |
| AdditionPrecedence            | left  | =+=, =-=, =\vert=, =^= | RangeFormation         |
| RangeFormationPrecedence      | none  | =...=, =..<==           | Casting                |
| ComparisonPrecedence          | none  | =<=, =>==, =====, =!=== | LogicalConjunction     |
| LogicalConjunctionPrecedence  | left  | =&&=                    | LogicalDisjunction     |
| LogicalDisjunctionPrecedence  | left  | =\vert\vert=            | Ternary                |
| TernaryPrecedence             | right | =? :=                   | Assignment             |
| AssignmentPrecedence          | right | ===, =+=, etc.          | FunctionArrow          |

*** Key Lessons from Swift
- *Strength*: Partial order means unrelated operators are *not* silently ordered. Mixing them without parens is a compile error. This eliminates the entire class of precedence bugs.
- *Strength*: =lowerThan= can reference groups from other modules -- allows inserting new levels below imported groups without modifying them.
- *Strength*: Transitivity is checked; cycles are forbidden.
- *Weakness*: More verbose to declare than numeric levels.
- *This is the emerging consensus for new language design* (also adopted by Carbon, Fortress, Rhombus).

** 6. Scala & OCaml — First-Character-Based Precedence

Both determine precedence entirely from the operator's *first character*:

| Priority | First Char(s)  | Scala Examples       | OCaml Level |
|----------+----------------+----------------------+-------------|
| Lowest   | letters, =$=   | =max=, =to=          | --          |
| ...      | =\vert=        | =\vert=, =\vert\vert= | Level 0   |
|          | =^=            | =^=, =^^=            | Level 1     |
|          | =&=            | =&=, =&&=            | --          |
|          | ===, =!=       | ====, =!==            | Level 0     |
|          | =<=, =>=       | =<=, =>==             | Level 0     |
|          | =:=            | =:=, =::=            | --          |
|          | =+=, =-=       | =+=, =-=, =++=       | Level 2     |
|          | =*=, =/=, =%= | =*=, =/=              | Level 3     |
| Highest  | other special  | =?=, =~=             | Level 4     |

Scala: last character =:= makes it right-associative. OCaml: =**= prefix makes it right-associative.

*** Key Lessons
- *Strength*: Zero ceremony -- precedence just works for conventional operator names. No declarations needed.
- *Weakness*: No customization. If your DSL operator starts with =+=, it gets addition-level precedence whether you want it or not.
- *Not suitable for Prologos*: We want user-definable precedence, and our operators are words (=add=, =mul=) not symbols.

** 7. Tcl =expr= — Infix Sublanguage in a Homoiconic Host

Tcl is command-based (like Prologos is prefix-based). The =expr= command provides a C-like infix sublanguage:

#+begin_example
set result [expr {3 + 4 * 5}]    ;# => 23
if {$x > 0 && $y < 10} { ... }   ;# expr in condition
#+end_example

*** Key Lessons from Tcl
- *Bracing matters enormously*: =expr {$x + $y}= is ~9x faster than =expr $x + $y= because the braced form can be bytecode-compiled and cached. The unbraced form forces string concatenation + re-parse every time.
- *Security*: Unbraced =expr $userinput= is a code injection vector.
- *The sublanguage approach works*: Tcl demonstrates that a host language with uniform syntax (=command arg arg=) can successfully embed an infix sublanguage for arithmetic. The key is clear delimiters (braces in Tcl, =.{...}= in our case).
- *Cognitive load*: Users must know two grammars. Minimizing the delta between them helps.

** 8. Racket (Our Host) — SRFI-105, k-infix, Rhombus/Enforest

