docs/tracking/2026-02-23_MIXFIX_SYNTAX_DESIGN.md


<a id="orgc2adf88"></a>

### SRFI-105 Curly-Infix

Deliberately minimal: `{a + b}` -> `(+ a b)`. Same operator folds: `{a + b + c}` -> `(+ a b c)`. Mixed operators: `{a + b * c}` -> `($nfx$ a + b * c)` &#x2013; deliberately **no** precedence at the reader level.


<a id="org1793dec"></a>

### k-infix (Racket Package)

Full Pratt-style parser with configurable precedence table:

```
($ 3 + 4 * 5)        ;; => 23
($ sin(x) + cos(y))  ;; => (+ (sin x) (cos y))
```


<a id="org088df25"></a>

### Rhombus Enforest (Most Relevant)

Rhombus (Racket's new surface language) uses **relative precedence declarations** that are:

-   **Not transitive**: `A > B` and `B > C` does NOT imply `A > C`
-   **Partial**: Two operators have a relationship only if explicitly declared
-   **Ambiguity = error**: No relationship between adjacent operators requires parentheses

```rhombus
operator (x <> y):
  ~weaker_than: * / + -
  Posn(x, y)
```

Declaration keywords: `~weaker_than`, `~stronger_than`, `~same_as`, `~same_as_on_left`, `~same_as_on_right`, `~associativity`.

This is the closest prior art to what we want for Prologos.


<a id="org7556bd2"></a>

## 9. Julia — Homoiconic with Native Infix

Julia is the most interesting case: a **homoiconic** language where infix is the **primary** surface form. Internally, `1 + 2 * 3` produces the AST `Expr(:call, :+, 1, Expr(:call, :*, 2, 3))` &#x2013; the same prefix tree a Lisp would produce.

Precedence is determined by Unicode character class (`+`-like at `prec-plus`, `*`-like at `prec-times`, etc.). Users **cannot** redefine precedence &#x2013; only define methods for existing operator symbols.

Julia also supports **chained comparisons**: `a < b <` c= desugars to `(a < b) && (b <` c)= with `b` evaluated only once. This is a popular ergonomic feature.


<a id="org553c078"></a>

### Key Lessons from Julia

-   **Proof that homoiconicity and infix coexist**: Julia's `Expr` type is manipulable code-as-data, just with infix surface syntax. Quote (`:(1 + 2)`) produces prefix trees.
-   **Character-class precedence is limiting**: Users cannot make a `+`-like symbol bind tighter than `*`. Open design issues since 2016.
-   **Chained comparisons are popular**: Worth considering for Prologos (`.{a < b <` c}=).


<a id="org174755f"></a>

# Part II: Design Patterns & Gotchas


<a id="orgfc8e67d"></a>

## The Classic C Precedence Bug

C's bitwise operators (`&`, `|`, `^`) have **lower** precedence than comparison (`==`, `<`). This was because originally there were no `&&` / `||`; bitwise operators served double duty. When logical operators were added, the bitwise precedence was not corrected. Dennis Ritchie later acknowledged this as a mistake.

Result: `if (x & mask =` 0)= parses as `if (x & (mask =` 0))=, not `if ((x & mask) =` 0)=.

This bug propagated to C++, Java, JavaScript, C#, and PHP. Only Swift, Go, Ruby, and Python get it right.

**Lesson for Prologos**: Do NOT define precedence between bitwise and comparison operators. Leave them unrelated; force parentheses.


<a id="orga4ec3ca"></a>

## Few Levels vs Many Levels

| Approach          | Levels | Languages               | Problem                      |
|----------------- |------ |----------------------- |---------------------------- |
| Few numeric       | 10     | Haskell                 | Slot scarcity, collisions    |
| Many numeric      | 1200   | Prolog                  | Cognitive overload           |
| Named groups      | DAG    | Swift, Carbon, Fortress | Verbose, but compositional   |
| Character-derived | ~10    | Scala, OCaml            | Inflexible, no customization |
| None              | 1      | Smalltalk, APL, Pony    | Violates math intuition      |

**Emerging consensus**: Named groups forming a partial order (Swift model) is the sweet spot for new languages.


<a id="org6d4aeb0"></a>

## The Precedence Interaction Problem

When combining libraries with different operator definitions:

-   Haskell: Only 10 slots, so libraries compete. Wrappers silently lose fixity.
-   Prolog: 1200 levels prevent collision but nobody memorizes the numbers.
-   Swift/Rhombus: Operators from different libraries have **no** relationship by default. Combining them requires explicit parentheses &#x2013; which is the **correct** behavior.


<a id="org11efc7c"></a>

## Pratt Parsing / Precedence Climbing

Pratt parsing (1973) and precedence climbing (1986) are the **same algorithm**. The key idea: each operator has a left binding power and right binding power. The algorithm recurses, stopping when it encounters an operator with binding power weaker than the current threshold.

**Associativity via asymmetric binding powers**:

-   Left-assoc: `right_bp = left_bp + 1` (right side slightly tighter, forces left-leaning tree)
-   Right-assoc: `right_bp = left_bp` (right side same, allows right-leaning tree)
-   Non-assoc: Same as left, but check for chaining and error

Adapts cleanly to partial orders by adding: if binding powers are **incomparable**, produce an error.


<a id="org5a2afbd"></a>

# Part III: Prologos Integration Analysis


<a id="orgfa4f1df"></a>

## Current Infrastructure

The preparse pipeline in `macros.rkt` already handles several syntactic transforms in order:

1.  **Implicit map rewriting** — indentation-based keyword blocks to map literals
2.  **Dot-access rewriting** — `user.name` -> `[map-get user :name]`
3.  **Infix operator rewriting** — `|>` and `>>` rewriting to block form
4.  **Macro expansion** — registered preparse macros (`let`, `do`, `if`, `with-transient`, etc.)
5.  **Placeholder desugaring** — `_` in application args -> anonymous lambda

The `.{...}` form would be handled at a new **step 0** or integrated into step 3, before macro expansion.


<a id="org820030a"></a>

## Existing Partial Application Machinery

Placeholders already work in application context:

-   `[add 1 _]` -> `(fn [$_0] [add 1 $_0])`
-   `[clamp _ 100 _]` -> `(fn [$_0] (fn [$_1] [clamp $_0 100 $_1]))`
-   Numbered: `[f _2 zero _1]` -> `(fn [$_1] (fn [$_2] [f $_2 zero $_1]))`

The `.{...}` form should reuse this: `.{_ + 1}` desugars to `[add _ 1]` which then hits the existing placeholder machinery.


<a id="org5be1a85"></a>

## Spec Entry System

`spec-entry` already stores metadata including `:where` constraints, `:implicits`, `:doc`, `:examples`, `:properties`. Adding `:mixfix` as another metadata key is straightforward:

```
spec add [A A] -> A
  :implicits {A : Type}
  :where (Add A)
  :mixfix {:symbol + :group additive :assoc :left}
```


<a id="org6bc467e"></a>

## Reader Integration

The `.{...}` delimiter needs reader-level support. Options:

1.  **Readtable extension**: Map `.` followed by `{` to a reader procedure that collects until matching `}` and produces a tagged datum (e.g., `($mixfix a + b * c)`).
2.  **Preparse rewrite**: If the sexp reader already produces `.` and `{...}` as separate tokens, the preparse layer can detect the pattern.

Option 1 is cleaner &#x2013; a single read produces the `($mixfix ...)` datum, which then enters the preparse pipeline for precedence resolution.


<a id="org217c2fb"></a>

# Part IV: Design Proposal


<a id="orga03f0f3"></a>

## 1. Surface Syntax: `.{...}`

The `.{...}` delimiter activates mixfix mode. Inside, operators are parsed with precedence:

```
.{a + b}           ;; => [add a b]        (or generic [+ a b])
.{a + b * c}       ;; => [add a [mul b c]]
.{a < b && c > d}  ;; => [and [lt a b] [gt c d]]
.{_ + 1}           ;; => (fn [$_0] [add $_0 1])
.{xs |> map f}     ;; => [map f xs]       (reuses pipe semantics)
```


<a id="orgd10f70d"></a>

### Nesting with `[]` for Prefix Calls Inside Mixfix

```
.{[length xs] + [length ys]}    ;; prefix calls inside mixfix
.{[f x] * [g y] + [h z]}       ;; clear grouping
```

This preserves prefix for function application while gaining infix for operators. `[]` inside `.{...}` is an **escape to prefix** &#x2013; the inverse of how `.{...}` is an escape to infix.
