docs/tracking/2026-02-23_MIXFIX_SYNTAX_DESIGN.md


<a id="org340936a"></a>

### Equivalence with Prefix

| Mixfix              | Prefix                    |
|------------------- |------------------------- |
| `.{a + b}`          | `[add a b]`               |
| `.{a + b * c}`      | `[add a [mul b c]]`       |
| `.{_ * _}`          | `[mul _ _]`               |
| `map .{_ + 1} xs`   | `map [add _ 1] xs`        |
| `.{a < b && b < c}` | `[and [lt a b] [lt b c]]` |


<a id="org0979c0c"></a>

## 2. Named Precedence Groups (Swift/Rhombus Model)

We adopt **named precedence groups forming a partial order DAG**, not numeric levels.


<a id="org89d76f0"></a>

### Built-in Groups

```
;; Defined in the Prologos core, not user-modifiable

precedence-group composition
  :assoc :right

precedence-group exponentiation
  :assoc :right
  :tighter-than multiplicative

precedence-group multiplicative
  :assoc :left
  :tighter-than additive

precedence-group additive
  :assoc :left
  :tighter-than comparison

precedence-group comparison
  :assoc :none
  :tighter-than logical-and

precedence-group logical-and
  :assoc :left
  :tighter-than logical-or

precedence-group logical-or
  :assoc :left
  :tighter-than pipe

precedence-group pipe
  :assoc :left
```

Note: **bitwise operators have NO relationship to comparison**. This avoids the C precedence bug entirely. Using bitwise and comparison operators together in `.{...}` requires explicit grouping.


<a id="org1c8e67e"></a>

### The Chain: `composition > exponentiation > multiplicative > additive > comparison > logical-and > logical-or > pipe`

This matches universal mathematical convention and the consensus across Haskell, Swift, Julia, and Prolog.


<a id="org4dc88f6"></a>

## 3. `:mixfix` Key on `spec`

Operators are registered via the `:mixfix` metadata key on `spec`:

```
;; Library definition of +
spec add [A A] -> A
  :implicits {A : Type}
  :where (Add A)
  :mixfix {:symbol + :group additive}

;; Library definition of *
spec mul [A A] -> A
  :implicits {A : Type}
  :where (Mul A)
  :mixfix {:symbol * :group multiplicative}

;; Library definition of ==
spec eq? [A A] -> Bool
  :implicits {A : Type}
  :where (Eq A)
  :mixfix {:symbol == :group comparison}

;; Unary prefix
spec neg [A] -> A
  :implicits {A : Type}
  :where (Neg A)
  :mixfix {:symbol - :kind :prefix :group unary}

;; User-defined operator
spec cross-product [Vec3 Vec3] -> Vec3
  :mixfix {:symbol cross :group multiplicative}
```


<a id="org114c2ca"></a>

### `:mixfix` Map Keys

| Key       | Type    | Default    | Description                        |
|--------- |------- |---------- |---------------------------------- |
| `:symbol` | Symbol  | (required) | The infix symbol used in `.{...}`  |
| `:group`  | Symbol  | (required) | Name of the precedence group       |
| `:kind`   | Keyword | `:infix`   | `:infix`, `:prefix`, or `:postfix` |
| `:assoc`  | Keyword | from group | Override group associativity       |

Associativity is typically inherited from the group. Override is for exceptional cases only.


<a id="org9993783"></a>

## 4. User-Defined Precedence Groups

Users can define new groups and insert them into the DAG:

```
precedence-group tensor-product
  :assoc :left
  :tighter-than additive
  :looser-than multiplicative

spec tensor [Tensor A Tensor A] -> [Tensor A]
  :implicits {A : Type}
  :mixfix {:symbol (x) :group tensor-product}
```

Rules:

-   `:tighter-than` and `:looser-than` reference existing groups.
-   Cycles in the DAG are a compile error.
-   Groups from different modules with no declared relationship are **unrelated** &#x2013; mixing their operators in `.{...}` requires explicit grouping.
-   Groups declared in library modules are imported with the module. The DAG is composed by union of edges across imports.


<a id="org7313319"></a>

## 5. Standard Operator Table


<a id="org74182da"></a>

### Arithmetic (via trait-dispatched generic operators)

| Symbol | Function | Group          | Assoc  | Trait |
|------ |-------- |-------------- |------ |----- |
| `+`    | `add`    | additive       | left   | `Add` |
| `-`    | `sub`    | additive       | left   | `Sub` |
| `*`    | `mul`    | multiplicative | left   | `Mul` |
| `/`    | `div`    | multiplicative | left   | `Div` |
| `%`    | `mod`    | multiplicative | left   | `Mod` |
| `^`    | `pow`    | exponentiation | right  | `Pow` |
| `-`    | `neg`    | unary          | prefix | `Neg` |


<a id="org562c496"></a>

### Comparison

| Symbol | Function | Group      | Assoc | Trait |
|------ |-------- |---------- |----- |----- |
| `==`   | `eq?`    | comparison | none  | `Eq`  |
| `!=`   | `neq?`   | comparison | none  | `Eq`  |
| `<`    | `lt?`    | comparison | none  | `Ord` |
| `<=`   | `le?`    | comparison | none  | `Ord` |
| `>`    | `gt?`    | comparison | none  | `Ord` |
| `>=`   | `ge?`    | comparison | none  | `Ord` |


<a id="org01f7598"></a>

### Logical

| Symbol       | Function | Group       | Assoc  |
|------------ |-------- |----------- |------ |
| `&&`         | `and`    | logical-and | left   |
| `\vert\vert` | `or`     | logical-or  | left   |
| `!`          | `not`    | unary       | prefix |


<a id="org7b0d44a"></a>

### Pipeline

| Symbol   | Function   | Group       | Assoc |
|-------- |---------- |----------- |----- |
| `\vert>` | pipe       | pipe        | left  |
| `>>`     | compose    | composition | right |
| `.`      | dot-access | (special)   | left  |


<a id="orgebb35e0"></a>

### Cons / Append

| Symbol | Function | Group    | Assoc |
|------ |-------- |-------- |----- |
| `::`   | `cons`   | cons     | right |
| `++`   | `append` | additive | left  |


<a id="orgbd0fc7b"></a>

## 6. Chained Comparisons (Julia-inspired)

Inside `.{...}`, consecutive comparison operators are desugared with short-circuit:

```
.{a < b <= c}
;; => [and [lt a b] [le b c]]    (with b evaluated once)

.{0 < x < 100}
;; => [and [lt 0 x] [lt x 100]]
```

Comparison operators are **non-associative** in isolation (`.{a < b < c}` is not `.{(a < b) < c}`). Instead, consecutive comparisons trigger the chained desugaring, which is a special preparse rule.


<a id="orgcf5d310"></a>

## 7. Parsing Algorithm

The `.{...}` parser uses **Pratt parsing** adapted for partial-order precedence:

1.  Reader produces `($mixfix token1 token2 ...)` datum from `.{...}` syntax.
2.  Preparse stage runs the Pratt parser on the token list.
3.  Each operator's binding power is looked up from `spec-entry` `:mixfix` metadata.
4.  If two adjacent operators have **no** precedence relationship (incomparable in the DAG), emit a compile error: "Operators `X` and `Y` have no defined precedence relationship &#x2013; use explicit grouping."
5.  Output is a standard prefix datum: `[add a [mul b c]]`.
6.  Wildcards (`_`) in the output are handled by the existing placeholder machinery.


<a id="org94a48b5"></a>

### Binding Power Encoding

Each named group gets a pair of binding powers `(left_bp, right_bp)` derived from the DAG topology:

-   Groups are topologically sorted.
-   `left_bp` is assigned based on position in topological order.
-   `right_bp = left_bp + 1` for left-associative, `left_bp` for right-associative.
-   Groups with no relationship have **incomparable** binding powers (not just equal &#x2013; distinct so the parser can detect and error).


<a id="org70583ca"></a>

## 8. Sexp Mode Equivalent

In sexp mode, `.{...}` has a direct equivalent:

```
;; WS mode:
.{a + b * c}

;; Sexp mode:
($mixfix a + b * c)
```

The `$mixfix` head triggers the same Pratt parser in the preparse stage.


<a id="org3ad681d"></a>

# Part V: Implementation Phases


<a id="org8a63ac1"></a>

## Phase 1: Core Reader & Parser (Minimum Viable)

-   Add `.{` reader syntax producing `($mixfix ...)` datum
-   Implement Pratt parser in `macros.rkt` with **fixed** precedence table (no user-definable yet)
-   Standard table: arithmetic, comparison, logical, pipe
-   Wildcard support via existing placeholder machinery
-   Tests: arithmetic expressions, comparison, logical, wildcards, nesting with `[]`
