docs/tracking/2026-02-23_MIXFIX_SYNTAX_DESIGN.org
** Phase 2: =:mixfix= on =spec= + User Groups
- Add =:mixfix= as recognized metadata key in =parse-spec-metadata=
- Store operator symbol -> =spec-entry= mapping for Pratt parser lookup
- Add =precedence-group= as a new top-level form
- Module-scoped group definitions: imported groups compose into DAG
- Tests: user-defined operators, custom precedence groups, cross-module

** Phase 3: Chained Comparisons + Diagnostics
- Special preparse rule for consecutive comparison operators
- Error messages for precedence ambiguity: "use =.{(a X b) Y c}= or =.{a X (b Y c)}="
- Pretty-printer support: print =.{a + b}= when source was mixfix
- REPL: show both mixfix and prefix forms

** Phase 4: Advanced Features (Future)
- Unicode operator symbols (=\oplus= at multiplicative, etc.)
- Postfix operators (=.{n!}= for factorial)
- Full mixfix patterns (=.{if p then a else b}=) -- Agda-style, if demand exists
- Interaction with =functor= keyword: =:compose= and =:identity= could auto-register mixfix

* Part VI: Design Decisions & Tradeoffs

** Decision 1: Named Groups vs Numeric Levels

*Recommendation: Named groups (Swift/Rhombus model).*

| Criterion          | Numeric (Haskell)     | Named Groups (Swift)           |
|--------------------+-----------------------+--------------------------------|
| Simplicity         | Simpler to declare    | More verbose                   |
| Extensibility      | Limited (10 slots)    | Unlimited (DAG grows)          |
| Cross-library      | Collision-prone       | Composable by default          |
| Ambiguity handling | Total order, silent   | Partial order, explicit errors |
| Implementation     | Simpler parser        | Needs DAG topology             |
| User intuition     | "7 > 6, done"        | "multiplicative > additive"    |

Named groups win on every criterion except initial simplicity. The verbose declaration is a one-time cost; the safety benefits accumulate over the lifetime of the language.

** Decision 2: =.{...}= Delimiters vs. No Delimiters

*Recommendation: Delimited with =.{...}=.*

Without delimiters (like Julia), infix becomes the default and prefix is the exception. This fundamentally changes the character of the language. With delimiters:
- Homoiconicity is preserved. The canonical form is prefix.
- The reader knows *exactly* when to switch parsing modes.
- No ambiguity between function application and infix operators.
- Consistent with the Tcl =expr= lesson: clear boundaries between sublanguages reduce cognitive load.

The =.= prefix is chosen because:
- =.= is already "reclaimed" for field access; =.{...}= is a natural extension (dot-something = accessor/sugar).
- It doesn't conflict with existing syntax: ={...}= alone is map literals.
- It's visually lightweight: =.{a + b}= is only 2 characters of overhead.

** Decision 3: Partial Application via =_=

*Recommendation: Reuse existing placeholder machinery.*

=.{_ + 1}= desugars to =[add _ 1]=, which the existing =expand-expression= in =macros.rkt= already converts to =(fn [$_0] [add $_0 1])=. No new machinery needed. This also means =.{_ * _}= produces a curried two-argument function, consistent with how =map [* _ _] xs= already works.

** Decision 4: Comparison Chaining

*Recommendation: Support chained comparisons (Julia-style).*

=.{a < b <= c}= -> =[and [lt a b] [le b c]]= with =b= evaluated once. This is:
- Mathematically natural (=0 < x < 100= reads as expected)
- Unambiguous (comparison operators are non-associative, so =a < b < c= can't mean =(a < b) < c=)
- Implemented as a special preparse rule, not a change to the precedence system

** Decision 5: Bitwise Operators

*Recommendation: No precedence relationship with comparison.*

Bitwise =&=, =|=, =^= are in their own group(s) with *no* edge to =comparison= in the precedence DAG. Using them together in =.{...}= requires explicit grouping:

#+begin_example
.{(x & mask) == 0}     ;; explicit — correct
.{x & mask == 0}        ;; ERROR: no precedence between bitwise-and and comparison
#+end_example

This *prevents the C bug by construction*.

* Part VII: Open Questions

1. *Should =.{...}= support statement-like forms?* E.g., =.{x = y + 1}= for assignment. Recommendation: No in Phase 1. Keep =.{...}= purely for expressions. Assignment remains =def x [add y 1]=.

2. *Should we support =.{...}= in =match= patterns?* E.g., =match n | .{_ + 1} => ...=. This requires extending patterns with infix sugar. Defer to Phase 4.

3. *What about =do= notation inside =.{...}=?* E.g., =.{x >>= fn [a] .{a + 1}}=. This is syntactically possible but may be too clever. Prefer =do= blocks for monadic code.

4. *Should =functor= =:compose= auto-register a mixfix symbol?* E.g., =functor Xf ... :compose xf-compose= could auto-generate =:mixfix {:symbol >> :group composition}=. Appealing but adds coupling.

* References

** Academic Papers
- Danielsson & Norell, "Parsing Mixfix Operators" (IFL 2008)
- Ryu, "Parsing Fortress Syntax" (PPPJ 2009)
- van den Brand et al., "Safe Specification of Operator Precedence Rules" (SLE 2013)
- Henzinger et al., "Regular Methods for Operator Precedence Languages" (ICALP 2023)
- Pratt, "Top Down Operator Precedence" (POPL 1973)

** Language Documentation
- [[https://agda.readthedocs.io/en/latest/language/mixfix-operators.html][Agda Mixfix Operators]]
- [[https://unimath.github.io/agda-unimath/MIXFIX-OPERATORS.html][agda-unimath Mixfix Guidelines]]
- [[https://maude.lcc.uma.es/manual271/maude-manualch3.html][Maude Manual Ch.3: Syntax and Basic Parsing]]
- [[https://www.swi-prolog.org/pldoc/man?section=operators][SWI-Prolog Operators]]
- [[https://www.haskell.org/onlinereport/haskell2010/haskellch3.html][Haskell 2010 Report: Expressions]]
- [[https://github.com/swiftlang/swift-evolution/blob/main/proposals/0077-operator-precedence.md][Swift SE-0077: Improved Operator Declarations]]
- [[https://github.com/carbon-language/carbon-lang/blob/trunk/proposals/p0555.md][Carbon Proposal #555: Operator Precedence]]
- [[https://docs.racket-lang.org/enforest/Operator_Precedence_and_Associativity.html][Rhombus Enforest: Operator Precedence]]
- [[https://docs.julialang.org/en/v1/manual/mathematical-operations/][Julia Mathematical Operations]]
- [[https://www.tcl.tk/man/tcl/TclCmd/expr.htm][Tcl expr Manual]]
- [[https://srfi.schemers.org/srfi-105/srfi-105.html][SRFI-105: Curly-infix-expressions]]

** Blog Posts & Practical Guides
- [[https://blog.adamant-lang.org/2019/operator-precedence/][Operator Precedence: We Can Do Better (Adamant Blog)]]
- [[https://www.foonathan.net/2017/07/operator-precedence/][Operator Precedence Is Broken (foonathan)]]
- [[https://kowainik.github.io/posts/fixity][Fix(ity) Me (Kowainik)]]
- [[https://matklad.github.io/2020/04/13/simple-but-powerful-pratt-parsing.html][Simple but Powerful Pratt Parsing (matklad)]]
- [[https://journal.stuffwithstuff.com/2011/03/19/pratt-parsers-expression-parsing-made-easy/][Pratt Parsers: Expression Parsing Made Easy (Bob Nystrom)]]
- [[https://www.oilshell.org/blog/2016/11/01.html][Pratt Parsing and Precedence Climbing Are the Same Algorithm (Oil Shell)]]
- [[https://lexi-lambda.github.io/blog/2017/08/12/user-programmable-infix-operators-in-racket/][User-Programmable Infix Operators in Racket (Alexis King)]]
- [[https://ericlippert.com/2020/02/27/hundred-year-mistakes/][Hundred Year Mistakes (Eric Lippert)]]
